In [1]:
import numpy as np

In [2]:
import pandas as pd

## Operations

In [3]:
df=pd.DataFrame({'col1':[1,2,3,4],'col2':[444,555,666,444],'col3':['abc','def','ghi','xyz']})

In [4]:
df

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [5]:
df.head()

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [6]:
# To find Unique values

In [7]:
df['col2'].unique() # will return an array

array([444, 555, 666], dtype=int64)

In [10]:
len(df['col2'].unique()) # To get the number method 1

3

In [11]:
df['col2'].nunique() # To get the number method 2

3

In [12]:
# To return number of times each unique value in colums show up

In [13]:
df['col2'].value_counts()

444    2
666    1
555    1
Name: col2, dtype: int64

## Condtional selection

In [16]:
df[(df['col1']>2) & (df['col2']==444)]

   col1  col2 col3
3     4   444  xyz

## Applying functions

In [18]:
# To apply function

In [19]:
df['col1'].sum()

10

In [20]:
# To apply custom function

In [22]:
def times2(x):
    return x*2

In [24]:
df['col1'].apply(times2) # it will be element wise too

0    2
1    4
2    6
3    8
Name: col1, dtype: int64

In [28]:
df['col3'].apply(len) # You can use built in functions for elements objects in data frame

0    3
1    3
2    3
3    3
Name: col3, dtype: int64

In [ ]:
df['col3'].len()  # here it will give an error, as you can't count a len for series

In [35]:
df['col2'].apply(lambda x: x*2) # To use lambda expression

0     888
1    1110
2    1332
3     888
Name: col2, dtype: int64

In [62]:
# removing column

In [38]:
df.drop('col1',axis=1)

   col2 col3
0   444  abc
1   555  def
2   666  ghi
3   444  xyz

In [42]:
# To know to column, or index name for usage in drop

In [43]:
df.columns

Index(['col1', 'col2', 'col3'], dtype='object')

In [44]:
df.index

RangeIndex(start=0, stop=4, step=1)

In [57]:
#To check if null

In [58]:
df.isnull()

    col1   col2   col3
0  False  False  False
1  False  False  False
2  False  False  False
3  False  False  False

In [63]:
# Sort and order

In [59]:
df

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [60]:
df.sort_values(by='col2',ascending=False) # you choose by what df.sort_values(by='what', things to notice)

   col1  col2 col3
2     3   666  ghi
1     2   555  def
0     1   444  abc
3     4   444  xyz

In [61]:
df.sort_values('col2') # It will assume ascending and by

   col1  col2 col3
0     1   444  abc
3     4   444  xyz
1     2   555  def
2     3   666  ghi

In [65]:
# Pivot table

In [66]:
data = {'A':['foo','foo','foo','bar','bar','bar'],
     'B':['one','one','two','two','one','one'],
       'C':['x','y','x','y','x','y'],
       'D':[1,3,2,5,4,1]}

df = pd.DataFrame(data)

In [67]:
df

     A    B  C  D
0  foo  one  x  1
1  foo  one  y  3
2  foo  two  x  2
3  bar  two  y  5
4  bar  one  x  4
5  bar  one  y  1

In [73]:
df.pivot_table('D',index=['A','B'],columns='C')  
# Values is the values to compare in pivot table
# main argument is values, index, and column
# index here will be multiindex means i want to have two levels for dividing
# Column mean that i want a column for x and a column for y

C          x    y
A   B
bar one  4.0  1.0
    two  NaN  5.0
foo one  1.0  3.0
    two  2.0  NaN

In [75]:
df.pivot_table(values='D',index=['A','B'],columns=['C'])

C          x    y
A   B
bar one  4.0  1.0
    two  NaN  5.0
foo one  1.0  3.0
    two  2.0  NaN

In [1]:
# df.info() to find data number of enteries

In [2]:
# df.head( ) to find the top of your table

In [ ]:
#df[['TotalPayBenefits','title_len']].corr() to find correlation

## Data I/P & O/P

In [98]:
# Target to reat and output data for:
#CSV, Excel, HTML, and SQL
#pandas can't import macros, formula, or images

In [99]:
#pip install sqlalchemy
#pip install  lxml 
#pip install html5lib
#pip install BeautifulSoup4
#pip install xlrd

In [79]:
import pandas as pd

In [86]:
# make sure they are at the same location you are working with
# pwd will see your current location

In [83]:
pwd

'C:\\Users\\Abdelrahman\\Desktop\\Refactored_Py_DS_ML_Bootcamp-master\\03-Python-for-Data-Analysis-Pandas'

In [87]:
# To read and open

In [88]:
pd.read_csv('example') 
# press 'tab' to autcomplete
# It will produce dataframe

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

In [89]:
#To write

In [91]:
df=pd.read_csv('example')

In [93]:
df.to_csv('My_output') 
#you will produce a file with a name my output
#

In [94]:
pd.read_csv('My_output')
#If you didn't write ,index=False in to that will happen

   Unnamed: 0   a   b   c   d
0           0   0   1   2   3
1           1   4   5   6   7
2           2   8   9  10  11
3           3  12  13  14  15

In [96]:
df.to_csv('MyOutput',index=False)

In [97]:
pd.read_csv('MyOutput')

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

In [100]:
# Read, and write on excel sheet

In [107]:
pd.read_excel('Excel_Sample.xlsx',sheet_name='Sheet1')
# Each sheet is a Data frame

   Unnamed: 0   a   b   c   d
0           0   0   1   2   3
1           1   4   5   6   7
2           2   8   9  10  11
3           3  12  13  14  15

In [117]:
df.to_excel('Excel_Sample2.xlsx',sheet_name='NewSheet')

In [118]:
# HTML read and write

In [ ]:
data = pd.read_html('https://docs.google.com/spreadsheets/d/1ULiamqmfaMtiuRoJxIBF9yUzyG7NekPv/edit?usp=sharing&ouid=117807610460679614974&rtpof=true&sd=true')
# There is a list of tables in pages, and what panda will do is turn this list and convert each item into a data fram

In [124]:
type(data)
data[0],head()

dict

In [ ]:
#SQL Reading and writing 

# It's better to search for driver for your specific sequal engie

In [129]:
from sqlalchemy import create_engine
# That will creat a simple sequal engine in memory

In [132]:
engine=create_engine('sqlite:///:memory:')
# It created a very small engine running in memeory

In [135]:
df.to_sql('my_table',engine)
# first argument is the name of your table
# second argument is the connection to your sql you created

ValueError: Table 'my_table' already exists.

In [138]:
sqldf=pd.read_sql('my_table',con=engine)
# It will read the sql running in memory

In [139]:
sqldf

   index  Unnamed: 0   a   b   c   d
0      0           0   0   1   2   3
1      1           1   4   5   6   7
2      2           2   8   9  10  11
3      3           3  12  13  14  15

## Notes from examples

In [2]:
#df.info() to get info about the function

In [ ]:
# count fn  to give count